/*
   Объектно ориентированное программирование (ООП)
   Это подход при котором программа строится из объектов
   Объект - это некая сущность, которая сущенствует в пространстве и времени
   Все объекты являются экземплярами какого либо класса или стрктуры, мы и сами являемся объектами в этом мире (объект класса мышь, объект класса телефон)
   Объекты принято классифицировать. Множетво объектов с одинаковым набором характеристик называют классом
   Характеристики объекта называют свойствами, кроме характеристик у объектов може быть еще состоянее

   Класс\структура - это синтаксическая конструкция описывающая объекты 
   класс\структура состоят из полей или членов (members) 
   Поля класса\структуры делятся на 2 типа: 

   1)переменные
   члены классов описывают характеристики объектов и его состояние

   2) методы
    определяют поведение объектов и взаимодействие их с другими объектами

    Метод - это функция внутри класса 


*/


#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "ru");

}
